## Feature Engineering:
Definition: is a process of extracting useful features from raw data suing math, statistics and domain knowledge.
Outlier detection, one hot encoding, handling missing values are few basic examples of feature engineering.

- Domain Knowledge
- Visualization
- Math/Statistics:outlier

### Outlier Detection and removal using percentile

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_height = pd.read_csv(r"C:\Users\Connie Wu\Desktop\rhoda\Python\Python Project\Feature Engineering\heights.csv")

In [3]:
df_height.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [4]:
max_threshold = df_height['height'].quantile(0.95)
max_threshold

9.689999999999998

In [5]:
df_height[df_height['height']>max_threshold]

    name  height
9  imran    14.5

In [6]:
min_thresold = df_height['height'].quantile(0.05)
min_thresold

3.6050000000000004

In [8]:
df_height[df_height['height'] < min_thresold]

      name  height
12  yoseph     1.2

In [9]:
df_height[(df_height['height']<max_threshold )& (df_height['height']>min_thresold)]

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [13]:
# Loading another dataset 

url = 'https://raw.githubusercontent.com/codebasics/py/master/ML/FeatureEngineering/1_outliers/bhp.csv'
df_bhp = pd.read_csv(url)
df_bhp.head

<bound method NDFrame.head of                        location       size  total_sqft  bath   price  bhk  \
0      Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2                   Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3            Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                      Kothanur      2 BHK      1200.0   2.0   51.00    2
...                         ...        ...         ...   ...     ...  ...
13195                Whitefield  5 Bedroom      3453.0   4.0  231.00    5
13196                     other      4 BHK      3600.0   5.0  400.00    4
13197     Raja Rajeshwari Nagar      2 BHK      1141.0   2.0   60.00    2
13198           Padmanabhanagar      4 BHK      4689.0   4.0  488.00    4
13199              Doddathoguru      1 BHK       550.0   1.0   17.00    1

       price_per_sqft
0                3699
1                4615
2                4305
3                6245
4                4250
...               ...
13195            6689
13196           11111
13197            5258
13198           10407
13199            3090

[13200 rows x 7 columns]>

In [14]:
df_bhp.shape

(13200, 7)

In [15]:
df_bhp.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07